experimental_cases/mesh_500mL/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    #includeEtc "caseDicts/setConstraintTypes"

    vessel
    {
        type            noSlip;
    }
    
    rotor
    {
        type            movingWallVelocity;
        value           $internalField;
    }

    inlet
    {
        type            turbulentInlet;
        referenceField  uniform (0 0.01 0);
        fluctuationScale (0.02 0.01 0.01);
        value           uniform (0 0.01 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
