experimental_cases/mesh_500mL/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( -0.05 -0.01 -0.05)
    (  0.05 -0.01 -0.05)
    (  0.05  0.135  -0.05)
    ( -0.05  0.135  -0.05)
    ( -0.05 -0.01  0.05)
    (  0.05 -0.01  0.05)
    (  0.05  0.135   0.05)
    ( -0.05  0.135   0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 65 40) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall walls
    (

        (0 4 7 3)
        (2 6 5 1)
        (0 3 2 1)
        (4 5 6 7)
	    //(1 5 4 0)
    )
    
    patch inlet
    (
        (1 5 4 0)
    )
    patch outlet
    (
        (3 7 6 2)
    )

);

// ************************************************************************* //
