experimental_cases/mesh_500mL/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.1;
        smoother        GaussSeidel;
        maxIter  20;
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        maxIter  20;
    }

    "(U|k|B|nuTilda|s).*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     5;
    nNonOrthogonalCorrectors 1;
}


// ************************************************************************* //
